Rhino.Inside.Revit API
GeometryDecoder.ToPolyCurves Method
 Converts the specified Autodesk.Revit.DB.CurveArrArray to an equivalent array of Rhino.Geometry.PolyCurve.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Rhino.Geometry.PolyCurve[] ToPolyCurves(
	this Autodesk.Revit.DB.CurveArrArray curveArrays
)
@staticmethod
def ToPolyCurves(
	curveArrays: Autodesk.Revit.DB.CurveArrArray
) -> Array[Rhino.Geometry.PolyCurve]
Parameters
curveArrays
Type: Autodesk.Revit.DB.CurveArrArray
Revit curveArray to convert.
Return Value
Type: Rhino.Geometry.PolyCurve[]
Rhino polyCurve array that is equivalent to the provided Revit curveArrArray.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.CurveArrArray. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToPolyCurves(CurveArrArray) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
PolyCurve[] rhinoCurves = revitCurveArray.ToPolyCurves();
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from System import Array
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_curves = revit_curvearray.ToPolyCurves() # type: RG.Array[PolyCurve]
 Using ToPolyCurves(CurveArrArray) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
PolyCurve[] rhinoCurves = GeometryEncoder.ToPolyCurves(revitCurveArray)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from System import Array
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_curve = GD.ToPolyCurves(revit_curvearray) # type: RG.Array[PolyCurve]
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace